backend: "python"
max_batch_size: 0
instance_group [{ kind: KIND_CPU }]

input [
{
    name: "model"
    data_type: TYPE_STRING
    dims: [ 1, 1 ]
}
]

output [
{
    name: "predictions"
    data_type: TYPE_UINT8
    dims: [ 1, -1, -1, 3 ]
}
]