backend: "python"
max_batch_size: 4
instance_group [{ kind: KIND_CPU }]

input [
{
    name: "input"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
},
{
    name: "num_colors"
    data_type: TYPE_INT64
    dims: [ 1 ]
}
]

output [
{
    name: "predictions"
    data_type: TYPE_UINT8
    dims: [ -1, 3 ]
}
]